In [1]:
#Q1:

In [2]:
#About Dataset I choose:
#Since we have not got an available dataset in tuoturial, I copy paste the code in HW1

In [3]:
import pandas as pd
url = "https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-05-05/villagers.csv"
df = pd.read_csv(url)
df.isna().sum()

row_n           0
id              1
name            0
gender          0
species         0
birthday        0
personality     0
song           11
phrase          0
full_id         0
url             0
dtype: int64

In [4]:
'________________________________________________________________________'

'________________________________________________________________________'

In [5]:
#Q2:

In [6]:
#Interaction with AI:
#https://chatgpt.com/share/245c196d-0b9b-468f-9154-69fd4f5be7be
#Chat seems to not be able to read the URL directly, but it provided me codes.

In [7]:
villagers_data = pd.read_csv(url)

# Get the number of rows and columns in the dataset
rows, columns = villagers_data.shape
rows, columns

(391, 11)

In [8]:
#According to Chatgpt, and in my summary:
#Observations means the objects we observe and research on (Rows, individual villagers)
#Variables means the different features of observations we focus on (Columns, characteristics of each villager)

In [9]:
'________________________________________________________________________'

'________________________________________________________________________'

In [10]:
#Q3

In [11]:
#After asking Chatgpt(we can see it in the link above) , we get:

In [12]:
print(villagers_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 391 entries, 0 to 390
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   row_n        391 non-null    int64
 1   id           390 non-null    object
 2   name         391 non-null    object
 3   gender       391 non-null    object
 4   species      391 non-null    object
 5   birthday     391 non-null    object
 6   personality  391 non-null    object
 7   song         380 non-null    object
 8   phrase       391 non-null    object
 9   full_id      391 non-null    object
 10  url          391 non-null    object
dtypes: int64(1), object(10)
memory usage: 33.7+ KB
None

In [13]:
print(villagers_data.describe())

            row_n
count  391.000000
mean   239.902813
std    140.702672
min      2.000000
25%    117.500000
50%    240.000000
75%    363.500000
max    483.000000

In [14]:
print(villagers_data.describe(include='all'))

             row_n       id     name gender species birthday personality  \
count   391.000000      390      391    391     391      391         391
unique         NaN      390      391      2      35      361           8
top            NaN  admiral  Admiral   male     cat     1-27        lazy
freq           NaN        1        1    204      23        2          60
mean    239.902813      NaN      NaN    NaN     NaN      NaN         NaN
std     140.702672      NaN      NaN    NaN     NaN      NaN         NaN
min       2.000000      NaN      NaN    NaN     NaN      NaN         NaN
25%     117.500000      NaN      NaN    NaN     NaN      NaN         NaN
50%     240.000000      NaN      NaN    NaN     NaN      NaN         NaN
75%     363.500000      NaN      NaN    NaN     NaN      NaN         NaN
max     483.000000      NaN      NaN    NaN     NaN      NaN         NaN

                song   phrase           full_id  \
count            380      391               391
unique            92      388               391
top     K.K. Country  wee one  villager-admiral
freq              10        2                 1
mean             NaN      NaN               NaN
std              NaN      NaN               NaN
min              NaN      NaN               NaN
25%              NaN      NaN               NaN
50%              NaN      NaN               NaN
75%              NaN      NaN               NaN
max              NaN      NaN               NaN

                                                      url
count                                                 391
unique                                                391
top     https://villagerdb.com/images/villagers/thumb/...
freq                                                    1
mean                                                  NaN
std                                                   NaN
min                                                   NaN
25%                                                   NaN
50%                                                   NaN
75%                                                   NaN
max                                                   NaN

In [15]:
print(villagers_data.head())

   row_n       id     name  gender    species birthday personality  \
0      2  admiral  Admiral    male       bird     1-27      cranky
1      3  agent-s  Agent S  female   squirrel      7-2       peppy
2      4    agnes    Agnes  female        pig     4-21        uchi
3      6       al       Al    male    gorilla    10-18        lazy
4      7  alfonso  Alfonso    male  alligator      6-9        lazy

          song    phrase           full_id  \
0   Steep Hill   aye aye  villager-admiral
1      DJ K.K.  sidekick  villager-agent-s
2   K.K. House   snuffle    villager-agnes
3   Steep Hill   Ayyeeee       villager-al
4  Forest Life  it'sa me  villager-alfonso

                                                 url
0  https://villagerdb.com/images/villagers/thumb/...
1  https://villagerdb.com/images/villagers/thumb/...
2  https://villagerdb.com/images/villagers/thumb/...
3  https://villagerdb.com/images/villagers/thumb/...
4  https://villagerdb.com/images/villagers/thumb/...

In [16]:
print(villagers_data.nunique())

row_n          391
id             390
name           391
gender           2
species         35
birthday       361
personality      8
song            92
phrase         388
full_id        391
url            391
dtype: int64

In [17]:
print(villagers_data['personality'].value_counts())

personality
lazy      60
normal    59
cranky    55
snooty    55
jock      55
peppy     49
smug      34
uchi      24
Name: count, dtype: int64

In [18]:
'________________________________________________________________________'

'________________________________________________________________________'

In [19]:
#Q4

In [20]:
#Because the dataset I use has only a single numeric variable row_n without missing values, I turned to use another dataset

In [21]:
new_url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv"
titanic_data = pd.read_csv(new_url)
print('shape:')
print(titanic_data.shape)
print('describe:')
print(titanic_data.describe())

shape:
(891, 15)
describe:
         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [22]:
#After comparison, we find:
#(a): There is supposed to be 15 columns but only 6 columns are shown in <titanic_data.describe()>
#(b): In variable <age>, the count is only 714, which is supposed to be 891

In [23]:
#After asking Chatgpt, we get:
#<df.shape> give you the total columns and rows, no matter non-numeric variables or missing data, However,
#<df.describe()> only describe numeric variable (answer of (a)) , and ignore missing data (answer of (b))

In [24]:
'________________________________________________________________________'

'________________________________________________________________________'

In [25]:
#Q5

In [26]:
#According to Chatgpt, and in my summary:
#An attribute just store an object of a fucntion
#A method need to do calculate (or computering) using the argument in ().

In [27]:
'________________________________________________________________________'

'________________________________________________________________________'

In [28]:
#Q6

In [29]:
#According to Chatgpt:
#count: number of non-null values in the column
#mean: the average value
#std: standard deviation, a measure of spread around the mean
#min: the smallest value
#25%: first quartile (25th percentile)
#50%: median (50th percentile)
#75%: third quartile (75th percentile)
#max: the largest value

In [30]:
'________________________________________________________________________'

'________________________________________________________________________'

In [31]:
#Q7

In [32]:
#New ChatBot session:
#https://chatgpt.com/share/5e62e64f-8847-46f0-afe5-31e0af7646b7

In [33]:
#According to Chatgpt, and in my summary:
#df.dropna() is used to drop Rows with any Missing Data
#del df['col'] is used to Drop a Specific Column

In [34]:
#1.
#By using df.dropna(), we can delete the observation with missing data and keep the dataset clean
#It is better when there is a few missing values and we are interset in analyzing complete records.

In [35]:
#2
#By using del df['col'], we can delete a whole variable and keep the dataset clean
#It is better when a variable have too much missing data that we can delete it.

In [36]:
#3
#Applying del df['col'] before using df.dropna() is important because:
#Minimizing Data Loss: to avoid a column with many missing values that isn't necessary cause row deletions.
#We can make an example

In [37]:
#4
dt1 = titanic_data.dropna()
for col in dt1.columns:
    if dt1[col].isnull().any():
        del dt1[col]
dt1

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [38]:
dt2 = titanic_data
for col in dt2.columns:
    if dt2[col].isnull().any():
        del dt2[col]
dt2 = dt2.dropna()
dt2

,survived,pclass,sex,sibsp,parch,fare,class,who,adult_male,alive,alone
0,0,3,male,1,0,7.2500,Third,man,True,no,False
1,1,1,female,1,0,71.2833,First,woman,False,yes,False
2,1,3,female,0,0,7.9250,Third,woman,False,yes,True
3,1,1,female,1,0,53.1000,First,woman,False,yes,False
4,0,3,male,0,0,8.0500,Third,man,True,no,True
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,Second,man,True,no,True
887,1,1,female,0,0,30.0000,First,woman,False,yes,True
888,0,3,female,1,2,23.4500,Third,woman,False,no,False
889,1,1,male,0,0,30.0000,First,man,True,yes,True
890,0,3,male,0,0,7.7500,Third,man,True,no,True

In [39]:
#In this case, we can find:
#In dt1 , we apply <df.dropna()> before <del df['col']>, we keep every variables, but we almost lost all of the observations.
#In dt2 , we apply <del df['col']> before <df.dropna()> that we can keep every observations by deleting onlyl 4 variables.
#So, applying del df['col'] before df.dropna() is important.

In [40]:
'________________________________________________________________________'

'________________________________________________________________________'

In [41]:
#Q8

In [42]:
#1:

In [43]:
#According to Chatgpt:
#Grouping: df.groupby("col1") groups the data by the unique values in col1.
#Selecting the column: ["col2"] selects the specific column col2 from the grouped data.
#Descriptive statistics: .describe() then calculates summary statistics for each group within col1 for col2.

In [44]:
#2

In [45]:
#df.describe() provides a column-wide summary and handles missing values by excluding them for each column independently.
#df.groupby("col1")["col2"].describe() provides a summary for specific groups (based on col1) and handles missing values within those groups.

In [46]:
#3

In [47]:
#I will create a new file to solve Q8-3
#link:
#https://jupyter.utoronto.ca/user/haoce.zhang@mail.utoronto.ca/notebooks/Error_fix.ipynb

In [48]:
'________________________________________________________________________'

'________________________________________________________________________'

In [49]:
#Q9

In [50]:
#Yes, here are summaries for each sessions.

In [51]:
#Session 1:
#https://chatgpt.com/share/245c196d-0b9b-468f-9154-69fd4f5be7be
'''Exploring Dataset Dimensions:

1. You asked how to get the number of rows and columns in a dataset. We discussed using the attribute df.shape, which returns a tuple representing the number of rows and columns.
Understanding "Observations" and "Variables":

2. We clarified that observations are the rows in a dataset (each individual record or data point), and variables are the columns (attributes or characteristics of the data).
Getting Summaries of Columns:

3. To summarize data, we explored several ways to use the pandas library in Python, including df.info(), df.describe(), df.head(), df.nunique(), and value_counts() for basic column insights.
Discrepancies Between df.shape and df.describe():

4. We discussed that df.shape gives the dataset's full dimensions (rows and columns), while df.describe() analyzes only numeric columns (unless include='all' is specified). The "count" in df.describe() reflects non-null values, which may differ from the total number of rows.
Attributes vs. Methods:

5. We explained the difference between attributes (e.g., df.shape, which do not need parentheses and simply store information) and methods (e.g., df.describe(), which perform actions and require parentheses).
Summary Statistics in df.describe():

6. We broke down the meaning of each statistic provided by df.describe(), including count, mean, std, min, 25%, 50% (median), 75%, and max.
Formula for Standard Deviation:

7. We provided the formula for sample standard deviation, used by df.describe(), which measures the spread of the data around the mean.'''

'Exploring Dataset Dimensions:\n\n1. You asked how to get the number of rows and columns in a dataset. We discussed using the attribute df.shape, which returns a tuple representing the number of rows and columns.\nUnderstanding "Observations" and "Variables":\n\n2. We clarified that observations are the rows in a dataset (each individual record or data point), and variables are the columns (attributes or characteristics of the data).\nGetting Summaries of Columns:\n\n3. To summarize data, we explored several ways to use the pandas library in Python, including df.info(), df.describe(), df.head(), df.nunique(), and value_counts() for basic column insights.\nDiscrepancies Between df.shape and df.describe():\n\n4. We discussed that df.shape gives the dataset\'s full dimensions (rows and columns), while df.describe() analyzes only numeric columns (unless include=\'all\' is specified). The "count" in df.describe() reflects non-null values, which may differ from the total number of rows.\nAttributes vs. Methods:\n\n5. We explained the difference between attributes (e.g., df.shape, which do not need parentheses and simply store information) and methods (e.g., df.describe(), which perform actions and require parentheses).\nSummary Statistics in df.describe():\n\n6. We broke down the meaning of each statistic provided by df.describe(), including count, mean, std, min, 25%, 50% (median), 75%, and max.\nFormula for Standard Deviation:\n\n7. We provided the formula for sample standard deviation, used by df.describe(), which measures the spread of the data around the mean.'

In [52]:
#Session 2:
#https://chatgpt.com/share/5e62e64f-8847-46f0-afe5-31e0af7646b7
'''Summary of This Session:
1. Efficient Use of df.dropna() and del df['col']:

2. df.dropna() removes rows or columns based on missing values. You can use it with or without arguments to drop rows/columns where missing data exists.
del df['col'] is used to delete specific columns, including those with missing values. This method is useful when you know a particular column isn't needed and has missing data.
Use Case for df.dropna() Without Arguments:

3. df.dropna() without arguments is ideal when you want to remove all rows that contain any missing values. This is useful when incomplete data could bias your results, and you need complete rows for analysis.
Use Case for del df['col']:

4. del df['col'] is preferred when you have a column with too many missing values that is irrelevant or unimportant for your analysis. Removing this column preserves the rows and valuable data in other columns.
Why Deleting Columns First (del df['col']) Matters:

5. Deleting columns with missing data before applying df.dropna() prevents unintended row deletions. This helps in retaining useful rows that may have valid data in other columns, minimizing data loss.
How to Delete Columns with Missing Data:

We demonstrated a method to delete columns that contain missing values using a loop with del df['col']. This approach gives fine control over the columns you wish to remove.
This session focused on efficiently managing missing data in datasets by using df.dropna() and del df['col'] for different scenarios. You learned when to prefer one method over the other and how to combine them to preserve important data while cleaning your dataset.'''

"Summary of This Session:\n1. Efficient Use of df.dropna() and del df['col']:\n\n2. df.dropna() removes rows or columns based on missing values. You can use it with or without arguments to drop rows/columns where missing data exists.\ndel df['col'] is used to delete specific columns, including those with missing values. This method is useful when you know a particular column isn't needed and has missing data.\nUse Case for df.dropna() Without Arguments:\n\n3. df.dropna() without arguments is ideal when you want to remove all rows that contain any missing values. This is useful when incomplete data could bias your results, and you need complete rows for analysis.\nUse Case for del df['col']:\n\n4. del df['col'] is preferred when you have a column with too many missing values that is irrelevant or unimportant for your analysis. Removing this column preserves the rows and valuable data in other columns.\nWhy Deleting Columns First (del df['col']) Matters:\n\n5. Deleting columns with missing data before applying df.dropna() prevents unintended row deletions. This helps in retaining useful rows that may have valid data in other columns, minimizing data loss.\nHow to Delete Columns with Missing Data:\n\nWe demonstrated a method to delete columns that contain missing values using a loop with del df['col']. This approach gives fine control over the columns you wish to remove.\nThis session focused on efficiently managing missing data in datasets by using df.dropna() and del df['col'] for different scenarios. You learned when to prefer one method over the other and how to combine them to preserve important data while cleaning your dataset."

In [53]:
#Session 3:
#https://chatgpt.com/share/6c258ebb-87d9-4ed1-8a97-0194a06c71dc
'''Common Python Errors: You encountered several Python errors, and we addressed each one:

NameError: 'pd' is not defined: This was resolved by importing the pandas library using import pandas as pd.
FileNotFoundError: This occurred due to an incorrect file path, and we discussed how to check the file location or path.
NameError: 'DF' is not defined: The variable name was case-sensitive, and we discussed ensuring the correct usage of df or DF.
SyntaxError: incomplete input: This was caused by incomplete code, like missing parentheses or incomplete statements.
AttributeError: 'SeriesGroupBy' object has no attribute 'describle': A typo in the method name was the issue, and it was corrected to describe.
KeyError: 'Sex' and 'Age': These occurred due to missing or incorrectly spelled column names. We covered how to verify column names, strip spaces, and rename columns if needed.
NameError: 'sex' is not defined: This was resolved by ensuring the correct reference to DataFrame columns (i.e., df['sex']).
General Debugging: We discussed best practices for handling errors, including checking column names, ensuring proper data loading, and using correct syntax when referencing DataFrame columns.'''

"Common Python Errors: You encountered several Python errors, and we addressed each one:\n\nNameError: 'pd' is not defined: This was resolved by importing the pandas library using import pandas as pd.\nFileNotFoundError: This occurred due to an incorrect file path, and we discussed how to check the file location or path.\nNameError: 'DF' is not defined: The variable name was case-sensitive, and we discussed ensuring the correct usage of df or DF.\nSyntaxError: incomplete input: This was caused by incomplete code, like missing parentheses or incomplete statements.\nAttributeError: 'SeriesGroupBy' object has no attribute 'describle': A typo in the method name was the issue, and it was corrected to describe.\nKeyError: 'Sex' and 'Age': These occurred due to missing or incorrectly spelled column names. We covered how to verify column names, strip spaces, and rename columns if needed.\nNameError: 'sex' is not defined: This was resolved by ensuring the correct reference to DataFrame columns (i.e., df['sex']).\nGeneral Debugging: We discussed best practices for handling errors, including checking column names, ensuring proper data loading, and using correct syntax when referencing DataFrame columns."